tests/App.Core.Tests/mutations/M006_auth_lock_after_more_than_three.patch
diff --git a/src/App.Core/AppCoreAuth.pas b/src/App.Core/AppCoreAuth.pas
--- a/src/App.Core/AppCoreAuth.pas
+++ b/src/App.Core/AppCoreAuth.pas
@@ -278,7 +278,7 @@ end;
 procedure TAuthService.RegisterWrongPassword(AUser: TUser);
 begin
   AUser.FailedAttempts := AUser.FailedAttempts + 1;
-  if AUser.FailedAttempts >= FMaxFailedAttempts then
+  if AUser.FailedAttempts > FMaxFailedAttempts then
     AUser.Locked := True;
   FUsers.Save(AUser);
 end;
