tests/App.Core.Tests/mutations/M003_task_search_case_sensitive.patch
diff --git a/src/App.Core/AppCoreTaskService.pas b/src/App.Core/AppCoreTaskService.pas
--- a/src/App.Core/AppCoreTaskService.pas
+++ b/src/App.Core/AppCoreTaskService.pas
@@ -137,7 +137,7 @@ begin
   LCount := 0;
 
   for I := 0 to Length(LAll) - 1 do
-    if Pos(LQuery, UpperCase(LAll[I].Title)) > 0 then
+    if Pos(LQuery, LAll[I].Title) > 0 then
     begin
       Result[LCount] := LAll[I];
       Inc(LCount);
