tests/App.Core.Tests/mutations/M004_configuration_relative_path.patch
diff --git a/src/App.Core/AppCoreConfiguration.pas b/src/App.Core/AppCoreConfiguration.pas
--- a/src/App.Core/AppCoreConfiguration.pas
+++ b/src/App.Core/AppCoreConfiguration.pas
@@ -58,7 +58,7 @@ begin
   FUpdateManifestUrl := '';
   FUpdateDownloadDir := 'updates';
 
-  LFileName := ExpandFileName(AFileName);
+  LFileName := AFileName;
   if not FileExists(LFileName) then
     Exit;
 
