tests/App.Core.Tests/mutations/M015_user_file_drop_email.patch
diff --git a/src/App.Core/AppCoreUserFileRepository.pas b/src/App.Core/AppCoreUserFileRepository.pas
--- a/src/App.Core/AppCoreUserFileRepository.pas
+++ b/src/App.Core/AppCoreUserFileRepository.pas
@@ -249,7 +249,7 @@ begin
   LId := ExtractJsonString(AJson, 'id');
   LUsername := ExtractJsonString(AJson, 'username');
   LDisplayName := ExtractJsonString(AJson, 'displayName');
-  LEmail := ExtractJsonString(AJson, 'email');
+  LEmail := '';
   LPasswordHash := ExtractJsonString(AJson, 'passwordHash');
   LSalt := ExtractJsonString(AJson, 'salt');
   LActive := ExtractJsonBool(AJson, 'active');
