tests/App.Core.Tests/mutations/M017_user_file_drop_password_hash.patch
diff --git a/src/App.Core/AppCoreUserFileRepository.pas b/src/App.Core/AppCoreUserFileRepository.pas
--- a/src/App.Core/AppCoreUserFileRepository.pas
+++ b/src/App.Core/AppCoreUserFileRepository.pas
@@ -250,7 +250,7 @@ begin
   LUsername := ExtractJsonString(AJson, 'username');
   LDisplayName := ExtractJsonString(AJson, 'displayName');
   LEmail := ExtractJsonString(AJson, 'email');
-  LPasswordHash := ExtractJsonString(AJson, 'passwordHash');
+  LPasswordHash := '';
   LSalt := ExtractJsonString(AJson, 'salt');
   LActive := ExtractJsonBool(AJson, 'active');
   LDeleted := ExtractJsonBool(AJson, 'deleted');
