tests/App.Core.Tests/mutations/M013_user_filter_includes_deleted_by_default.patch
diff --git a/src/App.Core/AppCoreUserService.pas b/src/App.Core/AppCoreUserService.pas
--- a/src/App.Core/AppCoreUserService.pas
+++ b/src/App.Core/AppCoreUserService.pas
@@ -263,6 +263,6 @@ begin
   if AUser.Deleted then
   begin
-    Result := ufDeleted in AFilters;
+    Result := True;
     Exit;
   end;
 
